# LEARNING PANDAS 2

When there is no heading

In [2]:
import pandas as pd

a = pd.read_excel("titanic.xls", sheet_name="no heading")
a   # pd automatically takes the first row as heading, to avoid this refer to the code mentioned below

       jeet  25     Masters  Naikenpali        BBSR       SHADOW
0      aman  22  Graduation  Naikenpali  Naikenpali     CARELESS
1  utkalika  19  Graduation  Naikenpali  Naikenpali     CARELESS
2    shruti  22  Graduation  Dungripali         SBP  INTELLIGENT
3      Anil  29  Graduation  Bhagitikra  Bhagitikra   PERSUASIVE

In [ ]:
a = pd.read_excel("titanic.xls", sheet_name="no heading", header=None)
a

          0   1           2           3           4            5
0      jeet  25     Masters  Naikenpali        BBSR       SHADOW
1      aman  22  Graduation  Naikenpali  Naikenpali     CARELESS
2  utkalika  19  Graduation  Naikenpali  Naikenpali     CARELESS
3    shruti  22  Graduation  Dungripali         SBP  INTELLIGENT
4      Anil  29  Graduation  Bhagitikra  Bhagitikra   PERSUASIVE

How you can add names to existing columns

In [ ]:
a = pd.read_excel("titanic.xls", sheet_name="no heading", names=["Siksha", "Pata", "Current Address", "Charitra"])
a   # if you dont put enough names for the columns then the names from the top left will remain empty

# the heading names are being put from top right to the top left
# just remove one from the back and you will see the changes
# also when doing this, it removes the first row and then put the heading over there

                 Siksha        Pata Current Address     Charitra
aman     22  Graduation  Naikenpali      Naikenpali     CARELESS
utkalika 19  Graduation  Naikenpali      Naikenpali     CARELESS
shruti   22  Graduation  Dungripali             SBP  INTELLIGENT
Anil     29  Graduation  Bhagitikra      Bhagitikra   PERSUASIVE

In [6]:
a = pd.read_excel("titanic.xls", sheet_name="no heading", names=["Naam", "Umar", "Siksha", "Pata", "Current Address", "Charitra"])
a      # it doesnot make any changes in the excel sheet, [if you add extra names whose columns dont exist it will throw error]

       Naam  Umar      Siksha        Pata Current Address     Charitra
0      aman    22  Graduation  Naikenpali      Naikenpali     CARELESS
1  utkalika    19  Graduation  Naikenpali      Naikenpali     CARELESS
2    shruti    22  Graduation  Dungripali             SBP  INTELLIGENT
3      Anil    29  Graduation  Bhagitikra      Bhagitikra   PERSUASIVE

How to deal with the file who values are separated by '@' or any other symbol

In [3]:
# sep

b = pd.read_csv("iris_at.csv", sep="@")
b.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0

In [16]:
b["sepal length (cm)"].head(5)

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal length (cm), dtype: float64

How to skip rows

In [8]:
# skip

c = pd.read_excel("titanic.xls", sheet_name="no heading", skiprows=[0,1])
c

# here the next line after 1st index row, became the new heading

  utkalika  19  Graduation  Naikenpali Naikenpali.1     CARELESS
0   shruti  22  Graduation  Dungripali          SBP  INTELLIGENT
1     Anil  29  Graduation  Bhagitikra   Bhagitikra   PERSUASIVE

How to find data types of every column

In [9]:
a.dtypes

Naam               object
Umar                int64
Siksha             object
Pata               object
Current Address    object
Charitra           object
dtype: object

In [11]:
# will print names of all columns
a.columns

Index(['jeet', 25, 'Masters', 'Naikenpali', 'BBSR', 'SHADOW'], dtype='object')

In [ ]:
a = pd.read_excel("titanic.xls", sheet_name="no heading", names=["Naam", "Umar", "Siksha", "Pata", "Current Address", "Charitra"])

data = a["Naam"]            # printing all entire "Naam" column
print(type(data),'\n')      # its type is 'series'
print(type(a),'\n')         # its type is dataframe
print(data,'\n')

data2 = a["Naam"][:3]       # printing data in "Naam" column from start to row 2 (3 is exclusive)
print(data2,'\n')

# printing btwn the specific rows
data3 = a[["Naam", "Siksha", "Umar"]].iloc[0:3, :]     # REMEMBER YOU HAVE TO USE DOUBLE [[]] WHILE PRINTING MULTIPLE COLUMNS
print(data3,'\n')

""" 
    0:2 → take row indices 0 and 1 (2 is exclusive).
    : → take all columns of the already filtered DataFrame (here, "Naam", "Siksha", "Umar").

"""

<class 'pandas.core.series.Series'>

<class 'pandas.core.frame.DataFrame'>

0        aman
1    utkalika
2      shruti
3        Anil
Name: Naam, dtype: object

0        aman
1    utkalika
2      shruti
Name: Naam, dtype: object

       Naam      Siksha  Umar
0      aman  Graduation    22
1  utkalika  Graduation    19
2    shruti  Graduation    22

       Naam      Siksha  Umar
0      aman  Graduation    22
1  utkalika  Graduation    19
2    shruti  Graduation    22
3      Anil  Graduation    29

<class 'pandas.core.frame.DataFrame'>

       Naam      Siksha  Umar
0      aman  Graduation    22
1  utkalika  Graduation    19

loc vs iloc

In [18]:

#-----------------------------------------------------------------------------------------------------------------------------------------

data5 = a.loc[0:1, :]             # a.loc[start row : end row, start col : end col]
print(data5,'\n')

data6 = a.loc[:, ["Naam", "Siksha", "Umar"]]
print(data6,'\n')

# converting loc data into numpy array
data7 = a.loc[:, ["Naam", "Siksha", "Umar"]].values
print(data7,'\n')

data8 = a.loc[:, "Naam" : "Charitra"]           # will print from "Naam" to "Charitra"
print(data8,'\n') 
# if you dont know the column name and just want to print the columns using the index, in  that case you can just use iloc
#-----------------------------------------------------------------------------------------------------------------------------------------


data9 = a.iloc[:, :5]
print(data9, '\n')


data10 = a[["Naam", "Siksha", "Umar"]].iloc[0:3]
# data4 = a[["Naam", "Siksha", "Umar"]].head(4)            # or you can also do this to keep it simple
print(data10,'\n')  
print(type(data10),'\n')      # its type is 'object'

       Naam  Umar      Siksha        Pata Current Address  Charitra
0      aman    22  Graduation  Naikenpali      Naikenpali  CARELESS
1  utkalika    19  Graduation  Naikenpali      Naikenpali  CARELESS

       Naam      Siksha  Umar
0      aman  Graduation    22
1  utkalika  Graduation    19
2    shruti  Graduation    22
3      Anil  Graduation    29

[['aman' 'Graduation' 22]
 ['utkalika' 'Graduation' 19]
 ['shruti' 'Graduation' 22]
 ['Anil' 'Graduation' 29]]

       Naam  Umar      Siksha        Pata Current Address     Charitra
0      aman    22  Graduation  Naikenpali      Naikenpali     CARELESS
1  utkalika    19  Graduation  Naikenpali      Naikenpali     CARELESS
2    shruti    22  Graduation  Dungripali             SBP  INTELLIGENT
3      Anil    29  Graduation  Bhagitikra      Bhagitikra   PERSUASIVE

       Naam  Umar      Siksha        Pata Current Address
0      aman    22  Graduation  Naikenpali      Naikenpali
1  utkalika    19  Graduation  Naikenpali      Naikenpali
2    shruti    22  Graduation  Dungripali             SBP
3      Anil    29  Graduation  Bhagitikra      Bhagitikra

       Naam      Siksha  Umar
0      aman  Graduation    22
1  utkalika  Graduation    19
2    shruti  Graduation    22

<class 'pandas.core.frame.DataFrame'>